{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "ZeroPadding3D", "config": {"dtype": "float32", "padding": [[0, 0], [1, 1], [1, 1]], "trainable": true, "batch_input_shape": [null, 10, 64, 64, 3], "name": "zp3d_1", "data_format": "channels_last"}}, {"class_name": "Conv3D", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1], "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 32, "strides": [1, 2, 2], "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_size": [3, 4, 4], "activation": "linear", "padding": "valid", "name": "hconv3d_1", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "name": "lkrelu_1", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "ZeroPadding3D", "config": {"dtype": "float32", "name": "zp3d_2", "padding": [[0, 0], [1, 1], [1, 1]], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv3D", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1], "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 64, "strides": [1, 2, 2], "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_size": [3, 4, 4], "activation": "linear", "padding": "valid", "name": "hconv3d_2", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_constraint": null, "epsilon": 1e-05, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "axis": [4], "name": "bn_1", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "name": "lkrelu_2", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "ZeroPadding3D", "config": {"dtype": "float32", "name": "zp3d_3", "padding": [[0, 0], [1, 1], [1, 1]], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv3D", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1], "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 128, "strides": [1, 2, 2], "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_size": [3, 4, 4], "activation": "linear", "padding": "valid", "name": "hconv3d_3", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_constraint": null, "epsilon": 1e-05, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "axis": [4], "name": "bn_2", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "name": "lkrelu_3", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "ZeroPadding3D", "config": {"dtype": "float32", "name": "zp3d_4", "padding": [[0, 0], [1, 1], [1, 1]], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv3D", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1], "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 256, "strides": [1, 2, 2], "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_size": [3, 4, 4], "activation": "linear", "padding": "valid", "name": "hconv3d_4", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "gamma_constraint": null, "epsilon": 1e-05, "scale": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "axis": [4], "name": "bn_3", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "name": "lkrelu_4", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Conv3D", "config": {"bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1], "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "filters": 256, "strides": [1, 2, 2], "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "kernel_size": [2, 4, 4], "activation": "linear", "padding": "valid", "name": "embedding", "data_format": "channels_last"}}]}, "keras_version": "2.2.4-tf"}